
List<String> tipsBeforeVaccineList = [
  " تأكد من استشارة الطبيب: إذا كان الطفل يعاني من الحمى أو أي مرض، استشر الطبيب لتحديد ما إذا كان من المناسب تأجيل التطعيم.",
  " جهّز السجل الطبي: احضر سجل التطعيمات السابق لتحديثه وضمان عدم تكرار الجرعات.",
  "احرص على التغذية الجيدة: تأكد من أن الطفل تناول وجبة صحية وخفيفة قبل التطعيم لتجنب الدوار.",
  "اختر ملابس مريحة: تأكد من أن الطفل يرتدي ملابس تسهّل الوصول إلى الذراع أو الفخذ للتطعيم.",
  "حضّر الطفل نفسيًا: تحدث مع الطفل عن التطعيم بطريقة إيجابية لتهدئة مخاوفه، إذا كان واعيًا.",
  " احصل على قسط كافٍ من الراحة: تأكد من أن الطفل حصل على نوم كافٍ في الليلة السابقة.",
  "استفسر عن اللقاح: تأكد من معرفة اسم اللقاح وفائدته وأي آثار جانبية محتملة.",
  "اخبر الطبيب عن الحساسية: إذا كان الطفل يعاني من أي حساسية معروفة، أبلغ الطبيب قبل التطعيم.",
  " تأكد من موعد التطعيم: تحقق من التاريخ والمكان لضمان عدم نسيان الجرعة.",
  " احضر وسائل تسلية: إذا كان الطفل صغيرًا، احضر لعبة أو كتابًا لتشتيته أثناء انتظار التطعيم.",
];

/*
1. تأكد من استشارة الطبيب: إذا كان الطفل يعاني من الحمى أو أي مرض، استشر الطبيب لتحديد ما إذا كان من المناسب تأجيل التطعيم. 2. جهّز السجل الطبي: احضر سجل التطعيمات السابق لتحديثه وضمان عدم تكرار الجرعات. 3. احرص على التغذية الجيدة: تأكد من أن الطفل تناول وجبة صحية وخفيفة قبل التطعيم لتجنب الدوار. 4. اختر ملابس مريحة: تأكد من أن الطفل يرتدي ملابس تسهّل الوصول إلى الذراع أو الفخذ للتطعيم. 5. حضّر الطفل نفسيًا: تحدث مع الطفل عن التطعيم بطريقة إيجابية لتهدئة مخاوفه، إذا كان واعيًا. 6. احصل على قسط كافٍ من الراحة: تأكد من أن الطفل حصل على نوم كافٍ في الليلة السابقة. 7. استفسر عن اللقاح: تأكد من معرفة اسم اللقاح وفائدته وأي آثار جانبية محتملة. 8. اخبر الطبيب عن الحساسية: إذا كان الطفل يعاني من أي حساسية معروفة، أبلغ الطبيب قبل التطعيم. 9. تأكد من موعد التطعيم: تحقق من التاريخ والمكان لضمان عدم نسيان الجرعة. 10. احضر وسائل تسلية: إذا كان الطفل صغيرًا، احضر لعبة أو كتابًا لتشتيته أثناء انتظار التطعيم.
 */
